------------2025.3.25------------
这个星期要确定题目，下礼拜要派人上台汇报，所以赶紧想想点子这个周末结束前要确定下来最终选题的！

------------2025.4.22------------
前端同学：完成对话部分原型界面的搭建，并按照文档留好接口
后端同学：把对话部分的基础功能实现，并和测试同学一起看看模型和数据集的选择，这块可以一起讨论和做一下
测试同学：根据之前提到的数据，自己检索一下相关的资料，写点prompt测试一下不同模型的输出表现
以上过程自己做的部分请在代码或者文档中体现出来，比如那个功能是自己实现的，哪块测试是自己做的等，功能实现以后push到仓库里面（一定要用自己的账号）。部分地方可能表达的不是很清楚，有问题尽管提出来。因为周日要上课，所以我希望在这个周六的时候我能看到一些可以实现的东西。

还有，CTO同学最好在前后端的各个流程都有参与，做好项目的把控。CKO同学要及时记录一些探索到的东西，以及一些过程的零碎的内容（其实现在已经有很多东西可以记录了，整理起来push到仓库里）

------------2025.5.8------------
1. 后端的同学需要将模型部署，并且用fastapi给前端的同学调用（翟怡丹+刘佳凡） 2. 前端的同学则需要完成和后端的消息的交互，做一个保存历史对话信息管理的功能，，这一块可以用到数据库，数据库表的设计，(sqlite)数据库怎么用（苏宇翔+徐嘉雯+王博海）。

补充：
模型可以使用硅基流动的api，你们记一下sk-qopksyugdcrdnafcehrtuvjfpqpnkkznzagihikhcwsnyinj


------------2025.6.21------------
日历这块有几个问题：
1.打开设置的这个地方跳转的逻辑bug，具体看视频里出现的情况
2.时间选不了，只能选日期，这块是没做还是做错了我不清楚，一定要改了，而且这样显示不是很友好
3.通过日历选择日期这块显示的bug
这几个问题一定要解决掉@🍉 @Kepler 
然后来个测试组的同学把这块认领一下，把这里出现的情况写成一个issue再GitHub里提出来

对话这块也有问题：
文字输出的时候应该是流式输出（一个字一个字或几个字几个字的蹦出来）而不是非流式的，所有文字全部得到以后才一起输出会让用户觉得响应太慢，效果看起来是不好的，所以要改成stream模式@仰望 丶 暒涳 @王博海 
同样，来个测试的同学把这里的情况写成issue提到GitHub上


------------2025.6.23------------

目前push了一版，把输出改为了流式输出，并且加上了markdown的渲染
同时，测试了一下功能，发现历史记录的显示/读取有问题，相关的同学麻烦今天把这块问题处理一下
